

werat = ['መስከረም', 'ጥቅምት', 'ህዳር', 'ታህሳስ', 'ጥር', 'የካቲት', 'መጋቢት', 'ሚያዝያ', 'ግንቦት', 'ሰኔ', 'ሐምሌ', 'ነሐሴ', 'ጳጉሜ']

werhawi_dictionary = {'1': 'ልደታ፣ዮሐንስ ፣ራጉኤል ፣እዮብ ፣ኤልያስ ፣ ሶስና',
                      '10': 'መስቀለ ክርስቶስ ፣ናትናኤል ሐዋርያ ፣ፀደንያ ማርያም',
                      '11': 'ሐና እና ኢያቄም ፣አቡነ ሐራ',
                      '12': 'ሚካኤል፣ አባ ሳሙኤልና ፣ ናትናኤል ሐዋርያ',
                      '13': 'ፀጋ ኢየሱስ/ ዘርአ ብሩክ/ ፣ሩፋኤል ፣እግዚአብሔር አብ',
                      '14': 'አቡነ አረጋዊ ፣ገብረ ክርስቶስ/ገብረ መርአዊ/ ዘሚካኤል ፣ሙሴ ፀሊም',
                      '15': 'ቂርቆስና እየሉጣ ፣ሚናስ',
                      '16': 'ኪዳነ ምህረት ፣ኤልሳቤጥ',
                      '17': 'እስጢፋኖስ ፣ገሪማ ፣ወለተ ጴጥሮስ ፣አቡነ በትረ ማርያም ፣ ያዕቆብ ወልደ ዘብዲዮስ ፣ሙሴ',
                      '18': 'ማዕቀብ አልፋ ፣ኢዩስጣቲዮስ ፣ፊሊጶስ',
                      '19': 'ገብርኤል ፣ስልስቱ ደቂቅ፣ ይመርሐነ ክርስቶስ',
                      '2': 'በርቶሎሚዎስ ፣ጴጥሮስ ፣አባ ጉባ ፣መሪና',
                      '20': '፣ዮሐንስ ሀፂር ፤ሕንፀተ ቤተ ክርስቲያን',
                      '21': 'ቅድስት ድንግል ማርያም',
                      '22': 'ሉቃስ ፣ደቅስዮስ ፣ኡራኤል ፣ ብስራተ ገብርኤል',
                      '23': 'ቅዱስ ማር ጊዮርጊስ',
                      '24': 'ተክለ ሐይማኖት ፣ጎርጎርዮስ ፣24ቱ ካህናተ ሰማይ፣ ክርስረቶስ ሰምራ',
                      '25': 'ቅዱስ መርቆሬዎስ ፣አቡነ ሀቢብ',
                      '26': 'ዮሴፍ፣ ቶማስ ዘህንደኬ፣ አቡነ ሀብተ ማርያም',
                      '27': 'መድሐኔአለም ፣አቡነ መባዓ ፅዮን ተክለ አልፋማርያም',
                      '28': 'አማኑኤል ፣ .አበው አብርሃም ይህሳቅ ያዕቆብ',
                      '29': 'በዓለ እግዚአብሔር (በዓለወልድ)፣ቅዱስ ላሊበላ ፣ቅድስት አርሴማ',
                      '3': 'በአታ ማርያም ፣ፋኑኤል ፣ዜና ማርቆስ',
                      '30': 'ቅዱስ ማርቆስ ፡ ዮሐንስ መጥምቅ',
                      '4': 'ዮሐንስ ወልደ ነጎድጓድ ፣አባ መቃርዎስ፣ አባ አብርሐ',
                      '5': 'ጴጥሮስና ጳውሎስ ፣ገብረ መንፈስ ቅዱስ',
                      '6': 'ቁስቋም ፣ኢየሱስ ፣አርሴማ ቅድስት ፣እያሱ',
                      '7': 'አጋዕዝተ አለም ስላሴ ፣ዲዎስቆሮስ',
                      '8': 'ኪሮስ ፣ማቲዮስ፣ ኪሩቤል አርባእቱ እንስሳ፡ ዘካርያስ',
                      '9': 'ሰልስቱ ምዕት፣ ቶማስ ፣እስትንፋሰ ክርስቶስ ፣አትናትዮስ'}

ametawi_dictionary = {'ህዳር': {'11': 'ዕረፍተ ቅድስት ሀና',
                              '12': 'ቅዱስ ሚካኤል፡',
                              '13': 'እግዚአብሔር አብ/የአእላፍ መላእክት ቀን',
                              '14': 'አባ ዳንኤል እረፍቱ',
                              '15': 'ቅዱስ ሚናስ እረፍቱ',
                              '18': 'ሐዋርያው ቅዱስ ፊሊጶስ እረፍቱ ከ12ተ ሐዋርያት አንዱ',
                              '21': 'ፅዮን ማርያም/የእመቤታችን በዓል/',
                              '24': 'ሀያአራቱ ካህናተ ሰማይ /ደብረ ሊባኖስ/',
                              '25': 'ቅዱስ መርቆሪዎስ ሰማዕቱ /እረፍቱ/',
                              '26': 'አቡነ ሀብተማርያም /ደብረሊባኖስ/፡ አባ ኢየሱስ ሞአ(እረፍቱ)',
                              '27': 'አባ ተክለሃዋርያት ፡ ሐዋርው ቅዱስ ያዕቆብ በሰማዕትነት አረፈ',
                              '29': 'ተፈፃሚ ሰማዕት ቅዱስ ጴጥሮስ(እረፍቱ)',
                              '6': 'ቁስቋም ማርያም እመቤታችን ስደቷን ጨርሳ የገባችበት',
                              '7': 'ሕንጻ ቤቱ ለጊዮርጊስ/ አጥንቱ ተሰብስቦ መቃብር ቤት የገባበት/',
                              '8': 'በዓል አርባዕቱ እንስሳ /ክሩቤል ሱራፌል/አባኪሮስ'},
                      'ሐምሌ': {'10': 'ሓዋርያው ናትናኤል እረፍቱ',
                              '15': 'ኤፍሬም ሶርያዊው እረፍቱ',
                              '16': 'ወንጌላዊው ዮሐንስ እረፍቱ',
                              '18': '.የጻድቁ የዮሴፍ ልጅ ሐዋርያው ያዕቆብ እረፍቱ',
                              '19': 'በዓለ ቅዱስ ገብርኤል ቂርቆስና እየሉጣን ከእሳት ያዳነበት ቀን ነው/ቁልቢ ገብርኤል/',
                              '2': 'ሐዋርያው ታዴዎስ(እረፍቱ)',
                              '22': 'ቅዱስ ኡራኤል ፡አቡነ ጴጥሮስ ሰማዕትነት የተቀበሉበት',
                              '23': 'ቅዱስ ጊዮርጊስ',
                              '26': 'ቅዱስ ዮሴፍ (እረፍቱ) ፡አቡነ ሀብተማርያም ዘደብረሊባኖስ',
                              '28': 'ቅድስት መስቀል ክብራ (እረፍቷ)(የቅዱስ ላሊበላ የትዳሩ አጋር)',
                              '3': 'አባ ቄርሎስ(እረፍቱ)',
                              '30': 'ቅድስት ማርያም ክብራ(እረፍቷ)',
                              '4': 'ነቢዩ ሶፎንያስ እረፍቱ',
                              '5': 'ጴጥሮስና ጳውሎስ እረፍታቸው',
                              '7': 'አጋእዝተ ዓለም ስላሴ በአብርሃም ቤት፡ አባ ጊዮርጊስ ዘጋስጫ እረፍቱ',
                              '8': 'አባ ኪሮስ'},
                      'መስከረም': {'1': 'ቅዱስ ራጉኤል (ርእስ አውደ ዓመት/',
                                '10': 'ፀደኒያ ማርያም',
                                '15': 'ቅዱስ እስጢፋኖስ(የተሾመበት) (ይህ በዓል ከመስቀል በዓል ጋር የሚታሰብ ነው)',
                                '17': 'ቅዱስ እስጢፋኖስ /በዓለ መስቀል/',
                                '2': 'ቅዱስ ዮሀንስ /አንገቱ የተቆረጠበት ቀን/',
                                '21': 'መናገሻ ማርያም ፡ግሼን ማርያም ፡እንጦጦ ማርያም',
                                '29': 'ቅድስት አርሴማ'},
                      'መጋቢት': {'10': 'መስቀሉን ንግስት እሌኒ ቆፍሬ ያገኘችበት ቀን መድሀኔአለም',
                               '15': 'ቅድስት ሳራ(እረፍቷ)',
                               '22': 'ጥንተ ሆሳእና',
                               '27': 'ቸሩ መድሃኒአለም (የጌታችን ጥንተ ስቅለቱ መታሰቢያ)',
                               '29': 'የበዓለ ወልድ /የጌታችን ጽንሰት/',
                               '3': 'ተዝካረ ልደቱ ለአቡነ ገብረመንፈስ ቅዱስ',
                               '4': 'ቅዱስ ጊዮርጊስ /ደብረዘይት/'},
                      'ሚያዝያ': {'22': 'አባ ይስሀቅ(እረፍቱ)',
                               '23': 'የቅዱስ ጊዮርጊስ በዓለ እረፍት',
                               '27': 'ምስካየ ሕዙናን /ስደተኛው መድሀኒአለም/',
                               '30': 'ቅዱስ ማርቆስ በሰማዕትነት ያረፈበት ቀን ነው'},
                      'ሰኔ': {'11': 'ሰማዕቱ ቅዱስ ገላውድዮስ (እረፍቱ)',
                             '12': 'ቅዱስ ሚካኤል ባሕራንን ከውሃ ያወጣበት ቀን ነው(አፎምያን ከሰይጣን ያዳነበት)፡ ቅዱስ '
                             'ላሊበላ(እረፍቱ)',
                             '20': 'ሕንፀተ ቤተ ክርስቲያን',
                             '21': 'ጌታችን /የእመቤታችንን ቤት ያነጸበት ቀን ነው፡፡ ግሽን ማርያም በጎልጎታ በጌታችን መቃብር '
                             'የጸለየችበት',
                             '23': 'ጠቢቡ ሰሎሞን እረፍቱ',
                             '24': 'አባ ሙሴ ፀሊም(እረፍቱ)',
                             '25': 'የዮሴፍ ልጅ ሐዋርው ይሁዳ እረፍቱ',
                             '26': 'ኢያሱ እረፍቱ',
                             '27': 'እረፍቱ ለሐናንያ ሐዋርያ',
                             '30': 'ልደተ ዮሐንስ መጥምቅ',
                             '8': 'ከደረቅ ዓለት ላይ ውሃን ያፈለቀበት ከ33ቱ ከእመቤታችን በዓል አንዱ',
                             '9': 'ታላቁ ነብይ ሳሙኤል(እረፍቱ)(የሐና ልጅ)'},
                      'ታህሳስ': {'1.ነቢዩ': 'ኤልያስ የተወለደበት ቀን',
                               '12': 'አባ ሳሙኤል ዘዋልድባ',
                               '13': 'ቅዱስ ሩፋኤል',
                               '15': 'አባ ጎርጎርዮስ (እረፍቱ) ዘሀገረ አርማንያ',
                               '19': 'በዓለ ቅዱስ ገብርኤል',
                               '22': 'ብስራተ ገብርኤል /እመቤታችን ክርስቶስን እንደምትወልድ ያበሰረበት/',
                               '24': 'አቡነ ተክለሀይማኖት /ልደታቸው/',
                               '28': 'ቅዱስ አማኑኤል በዓለ ልደት ለእግዚእነ ገና',
                               '29': 'ቅዱስ በዓለ ወለድ /ተዘከረ ልደቱ ለእግዚነ/ገና/',
                               '3': 'በአታ ለማርያም እመቤታችን በሶስት አመቷ ቤተመቅደስ የገባችበት፡ አቡነ ዜና ማርቂስ(እረፍቱ)',
                               '4': 'ሐዋርያው እንድርያስ በሰማዕትነት ያረፈበት',
                               '6': 'ቅድስት አርሴማ(ቅዳሴ ቤቷ)'},
                      'ነሐሴ': {'13': 'እግዚአብሔር አብ በደብረታቦር ተራራ ጌታችን ብርሃነ መለኮቱ ለእነ ሙሴና ኤልያስ የገለጸበት ቀን '
                              'ነው/የቡሄ በዓል/',
                              '15': 'ቅድስት እነባመሪና(እረፍቷ)',
                              '16': 'ኪዳነምህረት',
                              '19': 'አባ መቃርስ የስጋው ፈልሰት',
                              '21': 'ጌቴ ሴማኒ ገዳም እመቤታችን (ሰበታ)',
                              '24': 'አቡነ ተክለሃይማት እረፍታቸው ፤ክርስቶስ ሳምረ',
                              '27': 'ቅዱስ ሱርያል(4 ሊቀ መላእክት)',
                              '28': 'አበው አብርሃም ይህሳቅ ያዕቆብ (እረፍታቸው)',
                              '7': 'ፅንሰታ ለማርያም'},
                      'የካቲት': {'15': 'ነቢዩ ዘካርያስ (እረፍቱ)',
                               '16': 'ኪዳነምህረት /እመቤታችን ቃልኪዳን የተቀበለችበት/',
                               '20': 'ቅዱስ ፊልጶስ',
                               '23': 'ቅዱስ ጊዮርጊስ',
                               '26': 'ነቢዩ ሆሴዕ (እረፍቱ)',
                               '28': 'ሮማዊው ቅዱስ ቴዌድሮስ(እረፍቱ)',
                               '3': 'አባ ያዕቆብ (እረፍቱ)',
                               '8': 'ጌታችን አምላካችን መድሀኒታችን ወደ ምኩራብ የገባበት ቀን(የአረጋዊው የስምዖን ታሪክ ልብ የበሉ)',
                               '9': 'አባ በርሱማ (እረፍቱ)'},
                      'ግንቦት': {'1': 'ልደታ እመቤታችን የተወለደችበት ቀን ነው',
                               '11': 'ቅዱስ ያሬድ(የተሰወረበት)',
                               '12': 'አቡነ ተክለሃይማኖት /አፅማቸው የፈለሰበት /ክርስቶስ ሳምራ',
                               '14': 'አቡነ አረጋዊ፡ ቅዱስ ገብረክርስቶስ',
                               '17': 'አባ ኤጲፋንዮስ(እረፍቱ)',
                               '21': 'እመቤታችን ማርያም /እመቤታችን በድብረ ምጥማቅ በምትባል ቦታ ወርቅ ወንበር ላይ ተቀምጣ ለአራት '
                               'ቀን የታየችበት ነው',
                               '24': 'ቁስቋም ማርያም /የስደቷ መነሻ/',
                               '28': 'ቅዱስ አማኑኤል፡ ቅድስት አመተ ክርስቶስ (እረፍቷ)',
                               '7': 'ሊቁ አቡነ አትናቲዎስ (እረፍቱ)'},
                      'ጥር': {'1': 'ቅዱስ እስጢፋኖስ ቀዳሚ ሰማእት (እረፍቱ)',
                             '11': 'በዓለ ጥምቀት',
                             '12': 'በዓለ ቅዱስ ሚካኤል /ቃና ዘገሊላ/',
                             '13': 'ቅዱስ ሩፋኤል /የቃና ዘገሊላ በዓል መታሰብያ/',
                             '14': 'አቡነ አረጋዊ',
                             '15': 'ቅዱስ ቂርቆስ እየሉጣ',
                             '18': 'ቅዱስ ጊዮርጊስ /ዝርዎተ አጽሙ/',
                             '21': 'የእመቤታችን በዓለ እረፍት',
                             '22': 'ቅዱስ ኡራኤል ቃል ኪዳን የተቀበለበትና የተሸመበት ቀን',
                             '23': 'ሐዋርያው ጢሞቲዋስ (እረፍቱ)',
                             '24': 'አቡነ ተክለሃይማኖት',
                             '28': 'ቅዱስ አማኑኤል ለ5000 ሰዎች ጌታችን ህብስቱን ያበረከተበት',
                             '4': 'ቅዱስ ዮሐንስ /ወንጌላዊ/ወልደ ነጎድጓድ',
                             '6': 'ኢየሱስ/ግዝረቱ ለእግዚእነ /እየሱስ ገዳም/ ነቢዩ ኤልያስ የተሰወረበት ቀን',
                             '7': 'ቅድስት ሥላሴ'},
                      'ጥቅምት': {'12.አባ': 'ዲሜጥሮስ(እረፍቱ)',
                               '13.አባ': 'ዘካርያስ(እረፍቱ)',
                               '14': 'አቡነ አረጋዊ (የተሰወሩበት)፡ በገብረክርስቶስ(እረፍቱ)፡ ኢትዮጰያዊውን ጀንደረባ ያጠመቀውን '
                               'ዲያቆኑ ፊሊጶስ (እረፍቱ)',
                               '17': 'ቅዱስ እስጢፋኖስ(የተሸመበት)',
                               '20': 'ዮሐንስ ሐፂር(እረፍቱ)',
                               '21.ነቢየ': 'እግዚአብሔር ኢዩኤል (እረፍቱ)',
                               '22': 'ወንጌላዊው ቅዱስ ሉቃስ (እረፍቱ)',
                               '25': 'አቡነ ሀቢብ አረፈ',
                               '27': 'መድሐኔአለም: አባ መብዓ ፅዮን (እረፍታቸው)',
                               '30': 'ቅዱስ ማርቆስ /ልደቱ/',
                               '5': 'አቡነ ገብረመንፈስ',
                               '8': 'ቅዱስ አማኑኤል',
                               '9': 'አባ አትናስዮስ(እረፍቱ)'},
                      'ጳጉሜ': {'2': 'ሐዋርያው ቲቶ (እረፍቱ)', '3': 'ቅዱስ ሩፋኤል', '4': 'አባ ባይሞን(እረፍቱ)'}}

import json

def dictGenerator():
    from ethiopian_date import EthiopianDateConverter
    from datetime import datetime
    year = 2016
    wendoch = 'ወንድ'
    setoch = 'ሴት'
    sunday = 6
    werhawi_dictionary = json.load(open("/Users/ab/Desktop/JA-COLAB/JA-COLAB/YEFIKIR_MAID_TERA/Files/Werhawi.json"))
    ametawi_dictionary = json.load(open("/Users/ab/Desktop/JA-COLAB/JA-COLAB/YEFIKIR_MAID_TERA/Files/Ametawi.json"))
    # FikirHibret_2016_Calendar = {wer: {[],[],[],[],[]} for wer in werat}
    FikirHibret_2016_Calendar = {wer: {} for wer in werat}
    for wer in werat:
        beal = ''
        collect = []
        for day in range(1, 31):
            if wer == 'ጳጉሜ' and sunday > 6:
                break

            werhawi = ''
            ametawi = ''
            sunday = sunday % 30

            if sunday == 0:
                sunday = 30

            if day == sunday:
                werhawi = f'ወርኅዊ በዓል -› {werhawi_dictionary[str(sunday)]}'

                if str(sunday) in ametawi_dictionary[wer].keys():
                    ametawi = f'| ዓመታዊ በዓል -› {ametawi_dictionary[wer][str(sunday)]}'

                ken = str(EthiopianDateConverter.to_gregorian(year, werat.index(wer)+1, sunday)).split('-')
                kenbewchi = datetime(int(ken[0]), int(ken[1]), int(ken[2]))
                kenbewchi = f"{kenbewchi.strftime('%B')} {ken[2]}"
                beal = f'ቀን -› {sunday} {werhawi} {ametawi}'
                zkr = f"""ዘካሪ ** {wendoch} እና {setoch}\nየሚዘከረው በዓል እና ቀኑ **  {beal}\nጸበል ጻዲቅ የሚቀርብበት ቀን በውጭ**  {kenbewchi}\nጸበል ጻዲቅ የሚቀርብበት ቀን በኢትዮጵያ **s {wer}  {sunday}"""

                collect.append(zkr)
                sunday += 7

        FikirHibret_2016_Calendar[wer] = collect

    return FikirHibret_2016_Calendar

def calendarGenerator():
    import pandas as pd
    FikirHibret_2016_Calendar = dictGenerator()
    df = pd.DataFrame.from_dict(data=FikirHibret_2016_Calendar, orient='index')
    df = df.transpose()
    df.to_excel('/Users/ab/Desktop/JA-COLAB/JA-COLAB/YEFIKIR_MAID_TERA/Files/FikirHibret_2016_Calendar_copy.xlsx', index=False)

if __name__== "__main__":
    calendarGenerator()
